DocumentJournals/FundsPlanningDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DocumentJournal>
		<Properties>
			<Name>FundsPlanningDocuments</Name>
			<RegisteredDocuments>
				<xr:Item>Document.PaymentReceiptPlan</xr:Item>
				<xr:Item>Document.CashOutflowPlan</xr:Item>
				<xr:Item>Document.CashTransferPlan</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Company</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.Company</xr:Item>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.Company</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.Company</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>CashAssetsType</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.CashAssetsType</xr:Item>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.CashAssetsType</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.CashAssetsType</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>PettyCash</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.PettyCash</xr:Item>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.PettyCash</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.PettyCash</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Item</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.CashFlowItem</xr:Item>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.CashFlowItem</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.CashFlowItem</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Counterparty</Name>
					<References>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.Counterparty</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.Counterparty</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>AmountReceipt</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.DocumentAmount</xr:Item>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.DocumentAmount</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>AmountExpense</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.DocumentAmount</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.DocumentAmount</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Currency</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.DocumentCurrency</xr:Item>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.DocumentCurrency</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.DocumentCurrency</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Comment</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.Comment</xr:Item>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.Comment</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.Comment</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Author</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.Author</xr:Item>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.Author</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.Author</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>BankAccount</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.BankAccount</xr:Item>
						<xr:Item>Document.PaymentReceiptPlan.Attribute.BankAccount</xr:Item>
						<xr:Item>Document.CashOutflowPlan.Attribute.BankAccount</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

DocumentJournals/FundsPlanningDocuments/Forms/ListForm/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// EVENT HANDLERS
//

&AtServer
// Procedure - form event handler OnCreateAtServer
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Set the format for the current date: DF=H:mm
	SmallBusinessServer.SetDesignDateColumn(List);
	
EndProcedure

// Procedure - form event handler "OnLoadDataFromSettingsAtServer".
//
&AtServer
Procedure OnLoadDataFromSettingsAtServer(Settings)
	
	Company				  = Settings.Get("Company");
	Counterparty				  = Settings.Get("Counterparty");
	BankAccountPettyCash		  = Settings.Get("BankAccountPettyCash");
	
	SmallBusinessClientServer.SetListFilterItem(List, "Company", Company, ValueIsFilled(Company));
		SmallBusinessClientServer.SetListFilterItem(List, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	If TypeOf(BankAccountPettyCash) = Type("CatalogRef.PettyCashes") Then
		SmallBusinessClientServer.SetListFilterItem(List, "PettyCash", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	ElsIf TypeOf(BankAccountPettyCash) = Type("CatalogRef.BankAccounts") Then
		SmallBusinessClientServer.SetListFilterItem(List, "BankAccount", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	Else
		SmallBusinessClientServer.SetListFilterItem(List, "PettyCash", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
		SmallBusinessClientServer.SetListFilterItem(List, "BankAccount", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	EndIf;
	
EndProcedure // OnLoadDataFromSettingsAtServer()

// Procedure - event handler OnChange of attribute BankAccountPettyCash.
//
&AtClient
Procedure BankAccountPettyCashOnChange(Item)
	
	If TypeOf(BankAccountPettyCash) = Type("CatalogRef.PettyCashes") Then
		SmallBusinessClientServer.SetListFilterItem(List, "PettyCash", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	ElsIf TypeOf(BankAccountPettyCash) = Type("CatalogRef.BankAccounts") Then
		SmallBusinessClientServer.SetListFilterItem(List, "BankAccount", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	Else
		SmallBusinessClientServer.SetListFilterItem(List, "PettyCash", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
		SmallBusinessClientServer.SetListFilterItem(List, "BankAccount", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	EndIf;
	
EndProcedure

// Procedure - event handler OnChange of attribute Counterparty.
//
&AtClient
Procedure CounterpartyOnChange(Item)
	
	SmallBusinessClientServer.SetListFilterItem(List, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	
EndProcedure

// Procedure - event handler OnChange of the Company attribute.
//
&AtClient
Procedure CompanyOnChange(Item)
	
	SmallBusinessClientServer.SetListFilterItem(List, "Company", Company, ValueIsFilled(Company));
	
EndProcedure

&AtClient
Procedure ListOnActivateRow(Item)
	
	CurrentRow = Items.List.CurrentData;
	If CurrentRow <> Undefined Then
		Items.Information.Title = Format(CurrentRow.Date, "DLF=D");
	EndIf;
	
EndProcedure
